GopalSaraf/Practicals/PSDL/include/proc/pic18f67j60.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F67J60_INC_
#define _PIC18F67J60_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F67J60
 */

/*
 * Device Registers
 */

// Register: MAADR5
#define MAADR5 MAADR5
MAADR5                                   equ 0E80h

// Register: MAADR6
#define MAADR6 MAADR6
MAADR6                                   equ 0E81h

// Register: MAADR3
#define MAADR3 MAADR3
MAADR3                                   equ 0E82h

// Register: MAADR4
#define MAADR4 MAADR4
MAADR4                                   equ 0E83h

// Register: MAADR1
#define MAADR1 MAADR1
MAADR1                                   equ 0E84h

// Register: MAADR2
#define MAADR2 MAADR2
MAADR2                                   equ 0E85h

// Register: MISTAT
#define MISTAT MISTAT
MISTAT                                   equ 0E8Ah
// bitfield definitions
MISTAT_BUSY_POSN                         equ 0000h
MISTAT_BUSY_POSITION                     equ 0000h
MISTAT_BUSY_SIZE                         equ 0001h
MISTAT_BUSY_LENGTH                       equ 0001h
MISTAT_BUSY_MASK                         equ 0001h
MISTAT_SCAN_POSN                         equ 0001h
MISTAT_SCAN_POSITION                     equ 0001h
MISTAT_SCAN_SIZE                         equ 0001h
MISTAT_SCAN_LENGTH                       equ 0001h
MISTAT_SCAN_MASK                         equ 0002h
MISTAT_NVALID_POSN                       equ 0002h
MISTAT_NVALID_POSITION                   equ 0002h
MISTAT_NVALID_SIZE                       equ 0001h
MISTAT_NVALID_LENGTH                     equ 0001h
MISTAT_NVALID_MASK                       equ 0004h

// Register: EFLOCON
#define EFLOCON EFLOCON
EFLOCON                                  equ 0E97h
// bitfield definitions
EFLOCON_FCEN0_POSN                       equ 0000h
EFLOCON_FCEN0_POSITION                   equ 0000h
EFLOCON_FCEN0_SIZE                       equ 0001h
EFLOCON_FCEN0_LENGTH                     equ 0001h
EFLOCON_FCEN0_MASK                       equ 0001h
EFLOCON_FCEN1_POSN                       equ 0001h
EFLOCON_FCEN1_POSITION                   equ 0001h
EFLOCON_FCEN1_SIZE                       equ 0001h
EFLOCON_FCEN1_LENGTH                     equ 0001h
EFLOCON_FCEN1_MASK                       equ 0002h
EFLOCON_FULDPXS_POSN                     equ 0002h
EFLOCON_FULDPXS_POSITION                 equ 0002h
EFLOCON_FULDPXS_SIZE                     equ 0001h
EFLOCON_FULDPXS_LENGTH                   equ 0001h
EFLOCON_FULDPXS_MASK                     equ 0004h

// Register: EPAUS
#define EPAUS EPAUS
EPAUS                                    equ 0E98h

// Register: EPAUSL
#define EPAUSL EPAUSL
EPAUSL                                   equ 0E98h

// Register: EPAUSH
#define EPAUSH EPAUSH
EPAUSH                                   equ 0E99h

// Register: MACON1
#define MACON1 MACON1
MACON1                                   equ 0EA0h
// bitfield definitions
MACON1_MARXEN_POSN                       equ 0000h
MACON1_MARXEN_POSITION                   equ 0000h
MACON1_MARXEN_SIZE                       equ 0001h
MACON1_MARXEN_LENGTH                     equ 0001h
MACON1_MARXEN_MASK                       equ 0001h
MACON1_PASSALL_POSN                      equ 0001h
MACON1_PASSALL_POSITION                  equ 0001h
MACON1_PASSALL_SIZE                      equ 0001h
MACON1_PASSALL_LENGTH                    equ 0001h
MACON1_PASSALL_MASK                      equ 0002h
MACON1_RXPAUS_POSN                       equ 0002h
MACON1_RXPAUS_POSITION                   equ 0002h
MACON1_RXPAUS_SIZE                       equ 0001h
MACON1_RXPAUS_LENGTH                     equ 0001h
MACON1_RXPAUS_MASK                       equ 0004h
MACON1_TXPAUS_POSN                       equ 0003h
MACON1_TXPAUS_POSITION                   equ 0003h
MACON1_TXPAUS_SIZE                       equ 0001h
MACON1_TXPAUS_LENGTH                     equ 0001h
MACON1_TXPAUS_MASK                       equ 0008h

// Register: MACON3
#define MACON3 MACON3
MACON3                                   equ 0EA2h
// bitfield definitions
MACON3_FULDPX_POSN                       equ 0000h
MACON3_FULDPX_POSITION                   equ 0000h
MACON3_FULDPX_SIZE                       equ 0001h
MACON3_FULDPX_LENGTH                     equ 0001h
MACON3_FULDPX_MASK                       equ 0001h
MACON3_FRMLNEN_POSN                      equ 0001h
MACON3_FRMLNEN_POSITION                  equ 0001h
MACON3_FRMLNEN_SIZE                      equ 0001h
MACON3_FRMLNEN_LENGTH                    equ 0001h
MACON3_FRMLNEN_MASK                      equ 0002h
MACON3_HFRMEN_POSN                       equ 0002h
MACON3_HFRMEN_POSITION                   equ 0002h
MACON3_HFRMEN_SIZE                       equ 0001h
MACON3_HFRMEN_LENGTH                     equ 0001h
MACON3_HFRMEN_MASK                       equ 0004h
MACON3_PHDREN_POSN                       equ 0003h
MACON3_PHDREN_POSITION                   equ 0003h
MACON3_PHDREN_SIZE                       equ 0001h
MACON3_PHDREN_LENGTH                     equ 0001h
MACON3_PHDREN_MASK                       equ 0008h
MACON3_TXCRCEN_POSN                      equ 0004h
MACON3_TXCRCEN_POSITION                  equ 0004h
MACON3_TXCRCEN_SIZE                      equ 0001h
MACON3_TXCRCEN_LENGTH                    equ 0001h
MACON3_TXCRCEN_MASK                      equ 0010h
MACON3_PADCFG0_POSN                      equ 0005h
MACON3_PADCFG0_POSITION                  equ 0005h
MACON3_PADCFG0_SIZE                      equ 0001h
MACON3_PADCFG0_LENGTH                    equ 0001h
MACON3_PADCFG0_MASK                      equ 0020h
MACON3_PADCFG1_POSN                      equ 0006h
MACON3_PADCFG1_POSITION                  equ 0006h
MACON3_PADCFG1_SIZE                      equ 0001h
MACON3_PADCFG1_LENGTH                    equ 0001h
MACON3_PADCFG1_MASK                      equ 0040h
MACON3_PADCFG2_POSN                      equ 0007h
MACON3_PADCFG2_POSITION                  equ 0007h
MACON3_PADCFG2_SIZE                      equ 0001h
MACON3_PADCFG2_LENGTH                    equ 0001h
MACON3_PADCFG2_MASK                      equ 0080h
MACON3_PADCFG_POSN                       equ 0005h
MACON3_PADCFG_POSITION                   equ 0005h
MACON3_PADCFG_SIZE                       equ 0003h
MACON3_PADCFG_LENGTH                     equ 0003h
MACON3_PADCFG_MASK                       equ 00E0h

// Register: MACON4
#define MACON4 MACON4
MACON4                                   equ 0EA3h
// bitfield definitions
MACON4_DEFER_POSN                        equ 0006h
MACON4_DEFER_POSITION                    equ 0006h
MACON4_DEFER_SIZE                        equ 0001h
MACON4_DEFER_LENGTH                      equ 0001h
MACON4_DEFER_MASK                        equ 0040h

// Register: MABBIPG
#define MABBIPG MABBIPG
MABBIPG                                  equ 0EA4h
// bitfield definitions
MABBIPG_BBIPG0_POSN                      equ 0000h
MABBIPG_BBIPG0_POSITION                  equ 0000h
MABBIPG_BBIPG0_SIZE                      equ 0001h
MABBIPG_BBIPG0_LENGTH                    equ 0001h
MABBIPG_BBIPG0_MASK                      equ 0001h
MABBIPG_BBIPG1_POSN                      equ 0001h
MABBIPG_BBIPG1_POSITION                  equ 0001h
MABBIPG_BBIPG1_SIZE                      equ 0001h
MABBIPG_BBIPG1_LENGTH                    equ 0001h
MABBIPG_BBIPG1_MASK                      equ 0002h
MABBIPG_BBIPG2_POSN                      equ 0002h
MABBIPG_BBIPG2_POSITION                  equ 0002h
MABBIPG_BBIPG2_SIZE                      equ 0001h
MABBIPG_BBIPG2_LENGTH                    equ 0001h
MABBIPG_BBIPG2_MASK                      equ 0004h
MABBIPG_BBIPG3_POSN                      equ 0003h
MABBIPG_BBIPG3_POSITION                  equ 0003h
MABBIPG_BBIPG3_SIZE                      equ 0001h
MABBIPG_BBIPG3_LENGTH                    equ 0001h
MABBIPG_BBIPG3_MASK                      equ 0008h
MABBIPG_BBIPG4_POSN                      equ 0004h
MABBIPG_BBIPG4_POSITION                  equ 0004h
MABBIPG_BBIPG4_SIZE                      equ 0001h
MABBIPG_BBIPG4_LENGTH                    equ 0001h
MABBIPG_BBIPG4_MASK                      equ 0010h
MABBIPG_BBIPG5_POSN                      equ 0005h
MABBIPG_BBIPG5_POSITION                  equ 0005h
MABBIPG_BBIPG5_SIZE                      equ 0001h
MABBIPG_BBIPG5_LENGTH                    equ 0001h
MABBIPG_BBIPG5_MASK                      equ 0020h
MABBIPG_BBIPG6_POSN                      equ 0006h
MABBIPG_BBIPG6_POSITION                  equ 0006h
MABBIPG_BBIPG6_SIZE                      equ 0001h
MABBIPG_BBIPG6_LENGTH                    equ 0001h
MABBIPG_BBIPG6_MASK                      equ 0040h

// Register: MAIPG
#define MAIPG MAIPG
MAIPG                                    equ 0EA6h

// Register: MAIPGL
#define MAIPGL MAIPGL
MAIPGL                                   equ 0EA6h

