GopalSaraf/Practicals/PSDL/include/proc/pic18f67j60.inc
// Register: MAIPGH
#define MAIPGH MAIPGH
MAIPGH                                   equ 0EA7h

// Register: MAMXFL
#define MAMXFL MAMXFL
MAMXFL                                   equ 0EAAh

// Register: MAMXFLL
#define MAMXFLL MAMXFLL
MAMXFLL                                  equ 0EAAh

// Register: MAMXFLH
#define MAMXFLH MAMXFLH
MAMXFLH                                  equ 0EABh

// Register: MICMD
#define MICMD MICMD
MICMD                                    equ 0EB2h
// bitfield definitions
MICMD_MIIRD_POSN                         equ 0000h
MICMD_MIIRD_POSITION                     equ 0000h
MICMD_MIIRD_SIZE                         equ 0001h
MICMD_MIIRD_LENGTH                       equ 0001h
MICMD_MIIRD_MASK                         equ 0001h
MICMD_MIISCAN_POSN                       equ 0001h
MICMD_MIISCAN_POSITION                   equ 0001h
MICMD_MIISCAN_SIZE                       equ 0001h
MICMD_MIISCAN_LENGTH                     equ 0001h
MICMD_MIISCAN_MASK                       equ 0002h

// Register: MIREGADR
#define MIREGADR MIREGADR
MIREGADR                                 equ 0EB4h

// Register: MIWR
#define MIWR MIWR
MIWR                                     equ 0EB6h

// Register: MIWRL
#define MIWRL MIWRL
MIWRL                                    equ 0EB6h

// Register: MIWRH
#define MIWRH MIWRH
MIWRH                                    equ 0EB7h

// Register: MIRD
#define MIRD MIRD
MIRD                                     equ 0EB8h

// Register: MIRDL
#define MIRDL MIRDL
MIRDL                                    equ 0EB8h

// Register: MIRDH
#define MIRDH MIRDH
MIRDH                                    equ 0EB9h

// Register: EHT0
#define EHT0 EHT0
EHT0                                     equ 0EC0h

// Register: EHT1
#define EHT1 EHT1
EHT1                                     equ 0EC1h

// Register: EHT2
#define EHT2 EHT2
EHT2                                     equ 0EC2h

// Register: EHT3
#define EHT3 EHT3
EHT3                                     equ 0EC3h

// Register: EHT4
#define EHT4 EHT4
EHT4                                     equ 0EC4h

// Register: EHT5
#define EHT5 EHT5
EHT5                                     equ 0EC5h

// Register: EHT6
#define EHT6 EHT6
EHT6                                     equ 0EC6h

// Register: EHT7
#define EHT7 EHT7
EHT7                                     equ 0EC7h

// Register: EPMM0
#define EPMM0 EPMM0
EPMM0                                    equ 0EC8h

// Register: EPMM1
#define EPMM1 EPMM1
EPMM1                                    equ 0EC9h

// Register: EPMM2
#define EPMM2 EPMM2
EPMM2                                    equ 0ECAh

// Register: EPMM3
#define EPMM3 EPMM3
EPMM3                                    equ 0ECBh

// Register: EPMM4
#define EPMM4 EPMM4
EPMM4                                    equ 0ECCh

// Register: EPMM5
#define EPMM5 EPMM5
EPMM5                                    equ 0ECDh

// Register: EPMM6
#define EPMM6 EPMM6
EPMM6                                    equ 0ECEh

// Register: EPMM7
#define EPMM7 EPMM7
EPMM7                                    equ 0ECFh

// Register: EPMCS
#define EPMCS EPMCS
EPMCS                                    equ 0ED0h

// Register: EPMCSL
#define EPMCSL EPMCSL
EPMCSL                                   equ 0ED0h

// Register: EPMCSH
#define EPMCSH EPMCSH
EPMCSH                                   equ 0ED1h

// Register: EPMO
#define EPMO EPMO
EPMO                                     equ 0ED4h

// Register: EPMOL
#define EPMOL EPMOL
EPMOL                                    equ 0ED4h

// Register: EPMOH
#define EPMOH EPMOH
EPMOH                                    equ 0ED5h

// Register: ERXFCON
#define ERXFCON ERXFCON
ERXFCON                                  equ 0ED8h
// bitfield definitions
ERXFCON_BCEN_POSN                        equ 0000h
ERXFCON_BCEN_POSITION                    equ 0000h
ERXFCON_BCEN_SIZE                        equ 0001h
ERXFCON_BCEN_LENGTH                      equ 0001h
ERXFCON_BCEN_MASK                        equ 0001h
ERXFCON_MCEN_POSN                        equ 0001h
ERXFCON_MCEN_POSITION                    equ 0001h
ERXFCON_MCEN_SIZE                        equ 0001h
ERXFCON_MCEN_LENGTH                      equ 0001h
ERXFCON_MCEN_MASK                        equ 0002h
ERXFCON_HTEN_POSN                        equ 0002h
ERXFCON_HTEN_POSITION                    equ 0002h
ERXFCON_HTEN_SIZE                        equ 0001h
ERXFCON_HTEN_LENGTH                      equ 0001h
ERXFCON_HTEN_MASK                        equ 0004h
ERXFCON_MPEN_POSN                        equ 0003h
ERXFCON_MPEN_POSITION                    equ 0003h
ERXFCON_MPEN_SIZE                        equ 0001h
ERXFCON_MPEN_LENGTH                      equ 0001h
ERXFCON_MPEN_MASK                        equ 0008h
ERXFCON_PMEN_POSN                        equ 0004h
ERXFCON_PMEN_POSITION                    equ 0004h
ERXFCON_PMEN_SIZE                        equ 0001h
ERXFCON_PMEN_LENGTH                      equ 0001h
ERXFCON_PMEN_MASK                        equ 0010h
ERXFCON_CRCEN_POSN                       equ 0005h
ERXFCON_CRCEN_POSITION                   equ 0005h
ERXFCON_CRCEN_SIZE                       equ 0001h
ERXFCON_CRCEN_LENGTH                     equ 0001h
ERXFCON_CRCEN_MASK                       equ 0020h
ERXFCON_ANDOR_POSN                       equ 0006h
ERXFCON_ANDOR_POSITION                   equ 0006h
ERXFCON_ANDOR_SIZE                       equ 0001h
ERXFCON_ANDOR_LENGTH                     equ 0001h
ERXFCON_ANDOR_MASK                       equ 0040h
ERXFCON_UCEN_POSN                        equ 0007h
ERXFCON_UCEN_POSITION                    equ 0007h
ERXFCON_UCEN_SIZE                        equ 0001h
ERXFCON_UCEN_LENGTH                      equ 0001h
ERXFCON_UCEN_MASK                        equ 0080h

// Register: EPKTCNT
#define EPKTCNT EPKTCNT
EPKTCNT                                  equ 0ED9h

// Register: EWRPT
#define EWRPT EWRPT
EWRPT                                    equ 0EE2h

// Register: EWRPTL
#define EWRPTL EWRPTL
EWRPTL                                   equ 0EE2h

// Register: EWRPTH
#define EWRPTH EWRPTH
EWRPTH                                   equ 0EE3h

// Register: ETXST
#define ETXST ETXST
ETXST                                    equ 0EE4h

// Register: ETXSTL
#define ETXSTL ETXSTL
ETXSTL                                   equ 0EE4h

// Register: ETXSTH
#define ETXSTH ETXSTH
ETXSTH                                   equ 0EE5h

// Register: ETXND
#define ETXND ETXND
ETXND                                    equ 0EE6h

// Register: ETXNDL
#define ETXNDL ETXNDL
ETXNDL                                   equ 0EE6h

